DataProcessors/ВыгрузкаПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаПрайсЛиста</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекОпт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекОптБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекРозница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекРозницаБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПроизводитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МІСТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыПроизводства</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ВыгрузкаПрайсЛиста/Ext/ObjectModule.bsl
процедура Выгрузить(ВидНоменклатуры,БУГалочка) Экспорт
Если ВидНоменклатуры.Код = "000000002" Тогда
		Запрос = Новый Запрос;
		Файл = Новый ТекстовыйДокумент;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Номенклатура КАК Ссылка,
		               |	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК Остаток,
		               |	ВложенныйЗапрос.Номенклатура.БУ КАК БУ,
		               |	МАКСИМУМ(ВложенныйЗапрос1.Цена) КАК Цена,
		               |	ВложенныйЗапрос1.ТипЦен КАК ТипЦен,
		               |	МАКСИМУМ(ВложенныйЗапрос1.Поставщик) КАК Поставщик,
		               |	МАКСИМУМ(ВложенныйЗапрос1.Валюта) КАК Валюта,
		               |	МАКСИМУМ(ВложенныйЗапрос1.ДатаПроизводства) КАК ДатаПроизводства,
		               |	МАКСИМУМ(ВложенныйЗапрос1.Страна) КАК Страна
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		               |		ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |	ИЗ
		               |		РегистрНакопления.ТоварыНаСкладах.Остатки(
		               |				,
		               |				Номенклатура.ВидНоменклатуры = &ВидНом
		               |					И Номенклатура.БУ в (&БУ)) КАК ТоварыНаСкладахОстатки
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
		               |		СУММА(ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток)
		               |	ИЗ
		               |		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, Номенклатура.ВидНоменклатуры = &ВидНом) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		               |			ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
		               |			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		               |			ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик,
		               |			ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
		               |			ВложенныйЗапрос.ДатаПроизводства КАК ДатаПроизводства,
		               |			ВложенныйЗапрос.Страна КАК Страна
		               |		ИЗ
		               |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		               |					,
		               |					ТипЦен В (&списцен)
		               |						И Номенклатура.БУ в (&БУ)) КАК ЦеныНоменклатурыСрезПоследних
		               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |					ДатыПроизводстваСрезПоследних.Поставщик КАК Поставщик,
		               |					ДатыПроизводстваСрезПоследних.Номенклатура КАК Номенклатура,
		               |					МАКСИМУМ(ДатыПроизводстваСрезПоследних.ДатаПроизводства) КАК ДатаПроизводства,
		               |					МАКСИМУМ(ДатыПроизводстваСрезПоследних.Страна) КАК Страна
		               |				ИЗ
		               |					РегистрСведений.ДатыПроизводства.СрезПоследних КАК ДатыПроизводстваСрезПоследних
		               |				
		               |				СГРУППИРОВАТЬ ПО
		               |					ДатыПроизводстваСрезПоследних.Поставщик,
		               |					ДатыПроизводстваСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
		               |				ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВложенныйЗапрос.Номенклатура
		               |					И ЦеныНоменклатурыСрезПоследних.Поставщик = ВложенныйЗапрос.Поставщик
		               |		ГДЕ
		               |			ЦеныНоменклатурыСрезПоследних.ТипЦен.БазовыйТипЦен = &Пусто) КАК ВложенныйЗапрос1
		               |		ПО ВложенныйЗапрос.Номенклатура = ВложенныйЗапрос1.Номенклатура
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.Номенклатура,
		               |	ВложенныйЗапрос1.ТипЦен,
		               |	ВложенныйЗапрос.Номенклатура.БУ
		               |ИТОГИ
		               |	МАКСИМУМ(Остаток),
		               |	МАКСИМУМ(БУ),
		               |	МАКСИМУМ(Цена),
		               |	МАКСИМУМ(Поставщик),
		               |	МАКСИМУМ(Валюта),
		               |	МАКСИМУМ(ДатаПроизводства),
		               |	МАКСИМУМ(Страна)
		               |ПО
		               |	Ссылка,
		               |	ТипЦен";
		Запрос.УстановитьПараметр("ВидНом",ВидНоменклатуры);
		БУГалочка1 = Новый СписокЗначений;
		БУГалочка1.Добавить(БУГалочка);
		Если Не БУГалочка Тогда
			БУГалочка1.Добавить(истина);
			КонецЕслИ;
		Запрос.УстановитьПараметр("БУ",БУГалочка1);
		Запрос.УстановитьПараметр("Пусто",Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());
						   
						   //Запрос.УстановитьПараметр("списном",ТаблНом);
		списцен = Новый СписокЗначений;
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000007").Ссылка);
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001").Ссылка);
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000009").Ссылка);
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006").Ссылка);
		Запрос.УстановитьПараметр("списцен",списцен);		
		
		Рез = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		
		//РезЦены = ЗапросЦены.Выполнить().Выбрать();
		
		
		
		
		#Если Клиент Тогда		
		 Сообщить(ТекущаяДата());
		 #КонецЕсли
		 если БуГалочка Тогда
			СтрокаДока = ""+"Код"+"" + ";" +""+ "Поставщик" +""+ ";"+ ""+"Сезонность" +""+ ";"+ ""+"Ширина"+"" + ";" + ""+"ВысотаПрофиля"+"" + ";"+""+ "ДиаметрДиска"+"" + ";"+ ""+"ИндексНагрузки"+"" + ";"+ ""+"ИндексСкорости"+"" + ";"+ ""+"СпециальныйИндекс"+"" + ";"+""+ "ДополнительныеПараметры"+"" + ";"+"" + "Производитель"+"" + ";"+ ""+"Модель"+"" + ";"+ ""+"остаток"+"" + ";"+""+"Ц1"+"" +";" +"Валюта1"+ ";"+""+"Ц2"+"" +";" +"Валюта2"+ ";"+""+"Ц3"+"" +";" +"Валюта3"+ ";"+""+"Ц4"+"" +";" +"Валюта4"+ ";"+""+"Ц5" +""+";" +"Валюта5"+ ";"+""+"Ц6"+""+";" +"Валюта6"+ ";"+""+"Ц7"+"" +";" +"Валюта7"+ ";"+""+"Ц8"+"" +";" +"Валюта8"+ ";"+""+"Ц9"+"" +";" +"Валюта9"+ ";"+""+"Ц10"+""+";" +"Валюта10"+ ";"+""+ "Акция"+""+ ";"+"БУ"+";"+"Износ"+";"+"Страна"+";"+"ДатаПроизводства";//+ """"+Строка(Рез.Ссылка.Модель.СсылкаНаСайт) +"""";			
			Файл.ДобавитьСтроку(СтрокаДока);
			
			 КонецЕслИ;
		Пока Рез.Следующий() Цикл
			//Если Рез.Ссылка.ЭтоГруппа  Тогда
			//	Продолжить;
			//	КонецЕслИ;
//			Состояние(Рез.Ссылка);
			Остаток = Рез.Остаток;
//			РезЦены.Сбросить();
			Поставщик = "";
			Валюта = "";
			ц1  = "0"+""""+";"+""""+"грн";
			ц2 = "0"+""""+";"+""""+"грн";
			ц3 = "0"+""""+";"+""""+"грн";
			ц4 = "0"+""""+";"+""""+"грн";
			ц5 = "0"+""""+";"+""""+"грн";
			ц6 = "0"+""""+";"+""""+"грн";
			ц7 = "0"+""""+";"+""""+"грн";
			ц8 = "0"+""""+";"+""""+"грн";
			ц9 = "0"+""""+";"+""""+"грн";
			ц10 = "0"+""""+";"+""""+"грн";
			Страна = "";
			ДатаПроизводства = "";
			//Стр = Новый Структура;
			//Стр.Вставить("Номенклатура",Рез.Ссылка);
			РезЦены = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока РезЦены.Следующий() Цикл
				Если СокрЛП(РезЦены.ТипЦен.Код) = "000000006" Тогда
					ц1 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000009" Тогда
					ц2 = Строка(Формат(РезЦены.Цена*1.03,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000001" Тогда
					ц3 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
					Поставщик =(РезЦены.Поставщик); 
					ДатаПроизводства =Строка(РезЦены.ДатаПроизводства); 
					Страна =Строка(РезЦены.Страна); 

				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000007" Тогда
					ц4 = Строка(Формат(РезЦены.Цена*1.08,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000012" Тогда
					ц5 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000013" Тогда
					Ц6 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000020" Тогда
					Ц7 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000016" Тогда
					ц8 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000017" Тогда
					ц9 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000022" Тогда
					Ц10 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				КонецЕслИ;
			КонецЦикла;
				Поставщик = Строка(Поставщик);
			Если Рез.БУ Тогда
				БУ = "Б/У;"+Строка(Рез.Ссылка.Износ);
			Иначе
				БУ = ";;"
				КонецЕслИ;
			СтрокаДока = """"+Строка(Рез.Ссылка.Код)+"""" + ";" +""""+ Строка(Поставщик) +""""+ ";"+ """"+Строка(Рез.Ссылка.Сезонность) +""""+ ";"+ """"+Строка(Рез.Ссылка.Ширина)+"""" + ";" + """"+Строка(Рез.Ссылка.ВысотаПрофиля)+"""" + ";"+""""+ Строка(Рез.Ссылка.ДиаметрДиска)+"""" + ";"+ """"+Строка(Рез.Ссылка.ИндексНагрузки)+"""" + ";"+ """"+Строка(Рез.Ссылка.ИндексСкорости)+"""" + ";"+ """"+Строка(Рез.Ссылка.СпециальныйИндекс)+"""" + ";"+""""+ Строка(Рез.Ссылка.ДополнительныеПараметры)+"""" + ";"+"""" + Строка(Рез.Ссылка.Производитель)+"""" + ";"+ """"+Строка(Рез.Ссылка.Модель)+"""" + ";"+ """"+Строка(Формат(остаток,"ЧГ=0"))+"""" + ";"+""""+Строка(Ц1)+"""" + ";"+""""+Строка(Ц2)+"""" + ";"+""""+Строка(Ц3)+"""" + ";"+""""+Строка(Ц4)+"""" + ";"+""""+Строка(Ц5) +""""+ ";"+""""+Строка(Ц6)+""""+ ";"+""""+Строка(Ц7)+"""" + ";"+""""+Строка(Ц8)+"""" + ";"+""""+Строка(Ц9)+"""" + ";"+""""+Строка(Ц10)+"""" + ";"+""""+ Строка(Рез.Ссылка.Акция)+""""+ ";"+БУ+";"+Страна+";"+ДатаПроизводства;//+ """"+Строка(Рез.Ссылка.Модель.СсылкаНаСайт) +"""";			
			Файл.ДобавитьСтроку(СтрокаДока);
		КонецЦикла;
		если БУГалочка Тогда
		Файл.Записать("C:\TEmp\Price_BU.csv","cp1251");
		
		
	КаталогНаСервере = "web/pokryshka.com.ua/public_html/upload";
	Адрессайта = "62.149.15.213";
	Логин = "pokryshka";
	Пароль = "gA8Wr1UWg6";
	//    Попытка
	Сайт = Новый FTPСоединение(Адрессайта,"21",Логин,Пароль,,Истина);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	Сайт.Записать("C:\TEmp\Price_BU.csv","Price_BU.csv"); 
		
		
		#Если Клиент Тогда
		Сообщить("Выгрузили <C:\TEmp\Price_BU.csv>");
		#КонецЕсли
			Иначе
		Файл.Записать("C:\TEmp\Price.csv","cp1251");
		#Если Клиент Тогда
		Сообщить("Выгрузили <C:\TEmp\Price.csv>");
		#КонецЕсли
	КонецЕслИ;
		#Если Клиент Тогда
		 Сообщить(ТекущаяДата());
		 #КонецЕсли
	ИначеЕсли ВидНоменклатуры.Код = "000000001" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		                      |	ВложенныйЗапрос.Номенклатура Как Ссылка,
		                      |	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК Остаток
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		                      |		ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		                      |	ИЗ
		                      |		РегистрНакопления.ТоварыНаСкладах.Остатки(,Номенклатура.ВидНоменклатуры = &ВидНом) КАК ТоварыНаСкладахОстатки
		                      |	
		                      |	ОБЪЕДИНИТЬ ВСЕ
		                      |	
		                      |	ВЫБРАТЬ
		                      |		ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
		                      |		СУММА(ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток)
		                      |	ИЗ
		                      |		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, Номенклатура.ВидНоменклатуры = &ВидНом) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ВложенныйЗапрос.Номенклатура";
		Запрос.УстановитьПараметр("ВидНом",ВидНоменклатуры);
		
		
		Рез = Запрос.Выполнить();
		ТаблНом = Рез.Выгрузить().ВыгрузитьКолонку("Ссылка");
		Рез = Рез.Выбрать();
		Файл = Новый ТекстовыйДокумент;
		Запросцены = Новый Запрос;
		ЗапросЦены.Текст = "ВЫБРАТЬ
		                   |	ЦеныНоменклатурыСрезПоследних.Цена,
		                   |	ЦеныНоменклатурыСрезПоследних.ТипЦен,
		                   |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		                   |	ЦеныНоменклатурыСрезПоследних.Поставщик,
		                   |	ЦеныНоменклатурыСрезПоследних.Валюта
		                   |ИЗ
		                   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                   |			,
		                   |			ТипЦен В (&списцен)
		                   |				И Номенклатура В (&СписНом)) КАК ЦеныНоменклатурыСрезПоследних
		                   |ГДЕ
		                   |	ЦеныНоменклатурыСрезПоследних.ТипЦен.БазовыйТипЦен = &Пусто";
		ЗапросЦены.УстановитьПараметр("Пусто",Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());
						   
						   ЗапросЦены.УстановитьПараметр("списном",ТаблНом);
		списцен = Новый СписокЗначений;
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000007").Ссылка);
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001").Ссылка);
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000009").Ссылка);
		Списцен.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006").Ссылка);
		ЗапросЦены.УстановитьПараметр("списцен",списцен);
		РезЦены = ЗапросЦены.Выполнить().Выбрать();
		
		
			#Если Клиент Тогда		
		 Сообщить(ТекущаяДата());
		 #КонецЕсли
		Пока Рез.Следующий() Цикл
			Если Рез.Ссылка.ЭтоГруппа  Тогда
				Продолжить;
				КонецЕслИ;
			
			//Состояние(Рез.Ссылка);
			Остаток = Рез.Остаток;
			Стр = Новый Структура;
			Стр.Вставить("Номенклатура",Рез.Ссылка);
	
			
			РезЦены.Сбросить();
			Поставщик = "";
			Валюта = "";
			ц1  = "0"+""""+";"+""""+"грн";
			ц2 = "0"+""""+";"+""""+"грн";
			ц3 = "0"+""""+";"+""""+"грн";
			ц4 = "0"+""""+";"+""""+"грн";
			ц5 = "0"+""""+";"+""""+"грн";
			ц6 = "0"+""""+";"+""""+"грн";
			ц7 = "0"+""""+";"+""""+"грн";
			ц8 = "0"+""""+";"+""""+"грн";
			ц9 = "0"+""""+";"+""""+"грн";
			ц10 = "0"+""""+";"+""""+"грн";
			
			Пока РезЦены.НайтиСледующий(Стр) Цикл
				Если СокрЛП(РезЦены.ТипЦен.Код) = "000000016" Тогда
					ц1 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000017" Тогда
					ц2 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000006" Тогда
					ц3 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
					Поставщик =Строка(РезЦены.Поставщик); 
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000009" Тогда
					ц4 = Строка(Формат(РезЦены.Цена*1.03,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000001" Тогда
					ц5 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000007" Тогда
					Ц6 = Строка(Формат(РезЦены.Цена*1.08,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000012" Тогда
					Ц7 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000013" Тогда
					Ц8 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000020" Тогда
					Ц9 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
				ИначеЕсли СокрЛП(РезЦены.ТипЦен.Код) = "000000021" Тогда
					Ц10 = Строка(Формат(РезЦены.Цена,"ЧГ=0"))+""""+";"+""""+РезЦены.Валюта;
					
				КонецЕслИ;
				
			КонецЦикла;
			Если Рез.Ссылка.БУ Тогда
				БУ = "Б/У;"
			Иначе
				БУ = ";"
				КонецЕслИ;
			
			СтрокаДока = """"+Строка(Рез.Ссылка.Код)+"""" + ";" +""""+ Строка(Поставщик) +""""+ ";"+""""+ Строка(Рез.Ссылка.Производитель) +""""+ ";"+ """"+Строка(Рез.Ссылка.Модель) +""""+ ";"+ """"+Строка(Рез.Ссылка.Покраска)+"""" + ";" +""""+ Строка(Рез.Ссылка.ДиаметрДиска)+"""" + ";"+ """"+Строка(Рез.Ссылка.Ширина)+"""" + ";"+ """"+Строка(Рез.Ссылка.МежболтовоерасстояниеPCD1)+"""" + ";"+ """"+Строка(Рез.Ссылка.МежболтовоерасстояниеPCD2)+"""" + ";"+""""+ Строка(Рез.Ссылка.ВылетДисков)+"""" + ";"+"""" + Строка(Рез.Ссылка.Ступица)+"""" + ";"+ """"+Строка(Формат(остаток,"ЧГ=0"))+"""" + ";"+""""+Строка(Ц1)+"""" + ";"+""""+Строка(Ц2)+"""" + ";"+""""+Строка(Ц3)+"""" + ";"+""""+Строка(Ц4)+"""" + ";"+""""+Строка(Ц5) +""""+ ";"+""""+Строка(Ц6)+""""+ ";"+""""+Строка(Ц7)+"""" + ";"+""""+Строка(Ц8)+"""" + ";"+""""+Строка(Ц9)+"""" + ";"+""""+Строка(Ц10)+"""" + ";"+""""+Строка(Рез.Ссылка.Акция.Наименование)+"""" + ";"+БУ;//  """"+Строка(Рез.Ссылка.Модель.СсылкаНаСайт)+"""";			
			Файл.ДобавитьСтроку(СтрокаДока);
		КонецЦикла;
		Файл.Записать("C:\TEmp\PriceDiski.csv","cp1251");
		#Если Клиент Тогда		
		Сообщить("Выгрузили <C:\TEmp\PriceDiski.csv>");
		Сообщить(ТекущаяДата());
		#КонецЕсли
		
	КонецЕсли;
Конецпроцедуры
